[
    {
        "id": 1,
        "date": "Mon Mar 8, 2021",
        "progress": "Began working on a tracker for the 100 days of code challenge",
        "success": "I started!",
        "challenge": "Deciding what to work on",
        "thoughts": "Remember you're not alone! It helped me to read some articles from others who said the hardest part is getting started.",
        "link": "https://github.com/ncmarsh/100_days_of_code/commit/c18783e690487a3a79e9e5301d8f8388419e6ed5",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 2,
        "date": "Tues Mar 9, 2021",
        "progress": "Continued working on 100 days tracker by adding json object to map over on the render",
        "success": "Completed day 2!",
        "challenge": "Deciding what to work on",
        "thoughts": "Just get your keys to the keyboard",
        "link": "https://github.com/ncmarsh/100_days_of_code/commit/fc2b574ec1e542c207b3e1f94b80c0f5d8c50ea9",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 3,
        "date": "Wed Mar 10, 2021",
        "progress": "Continued working on 100 days tracker by adding react-router in order to switch between views",
        "success": "Made it thru Day 3!",
        "challenge": "Deciding what to work on remains a struggle",
        "thoughts": "This is my challenge. Remember to work on what interests you!",
        "link": "https://github.com/ncmarsh/100_days_of_code/commit/c422026f78f8b2905fe858d7b39be5956ee7ab99",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 4,
        "date": "Thurs Mar 11, 2021",
        "progress": "Returned back to my final project from my bootcamp, trying to debug a modal issue on the calendar page.",
        "success": "Getting my hands dirty",
        "challenge": "After combing through the code a few times over, I am so far unable to find the difference as to why one modal closes and the other doesn't",
        "thoughts": "Just keep swimming",
        "link": "https://github.com/UWB-Bandits/the-smoking-gun",
        "linkTitle": "My final project full repo"
    },
    {
        "id": 5,
        "date": "Fri Mar 12, 2021",
        "progress": "Spent the evening updating my portfolio to display my newest project, update the look and add additional details to it and update my contact info page.",
        "success": "Time flies! Spent a few hours working with React to update my portfolio.",
        "challenge": "Working with grids and image sizing",
        "thoughts": "Just keep it interesting!",
        "link": "https://github.com/ncmarsh/portfolio/commit/4c55c96d189b21b70bd680e878117e65d7bbd3bf",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 6,
        "date": "Sun Mar 14, 2021",
        "progress": "Time got away from me this weekend as I was able to finally visit family after a few months of not seeing them. With the busyness of the weekend, it was hard to carve out time on the computer. However I was able to spend an hour working through and completing Fundamentals II on the Grasshopper app.",
        "success": "Learned about new ways to handle arrays -> .pop() for example.",
        "challenge": "Making time",
        "thoughts": "Returning back to the fundamentals has reminded me how much I learned over the last 6 months and how much going back over everything will help solidify my knowledge. I will continue the next 2 weeks working on my team project for Demo Day, then I will return to the fundamentals.",
        "link": "",
        "linkTitle": ""
    },
    {
        "id": 7,
        "date": "Tues Mar 16, 2021",
        "progress": "Today I returned to my final project from bootcamp to continue debugging the modal issue. Finally found that the react state hook for that modal wasn't being set back to false, which was causing the closing issue (or lack thereof).",
        "success": "Found the bug!",
        "challenge": "Found the bug!",
        "thoughts": "Just focus on the problem at hand.",
        "link": "https://github.com/UWB-Bandits/the-smoking-gun/commit/a9818aa33a40fd849c4aed12f29d3eed6c63a99b",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 8,
        "date": "Wed Mar 17, 2021",
        "progress": "This evening I was researching and trying to understand how to implement form validation in React for my final project from bootcamp.",
        "success": "Fine-tuning those research skills.",
        "challenge": "Some days that information just won't absorb.",
        "thoughts": "It's ok to take a break away from the code to clear your mind.",
        "link": "",
        "linkTitle": ""
    },
    {
        "id": 9,
        "date": "Thurs Mar 18, 2021",
        "progress": "Just as I hoped, I was able to find my way out of the validation tunnel and things started to click. I was able to add form validations to the create/edit forms for my final project and found some more modals that needed updating for consistent styling.",
        "success": "Form validations for a better user experience.",
        "challenge": "Found a few bugs along they way and was able to clean things up as I moved through the app.",
        "thoughts": "Just make sure you have a plan, even if it's just for the next day. Getting a plan in place takes care of one of the harder steps: getting started.",
        "link": "https://github.com/UWB-Bandits/the-smoking-gun/pull/99/commits/ffd79e6dfb48b8c590b88e6c987e3c2ff79ec49f",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 10,
        "date": "Fri Mar 19, 2021",
        "progress": "Finished going over my project and adding in form validations for a better user experience.",
        "success": "All forms validated! Now time to move to the next thing. Also found duplicate code that wasn't needed in the project.",
        "challenge": "Where to display the alert on various components.",
        "thoughts": "There's probably a better/more efficient way of doing this.",
        "link": "https://github.com/UWB-Bandits/the-smoking-gun/pull/100/commits/7fa6ef55e9c261e7b25e0884fd35782a6e944b6d",
        "linkTitle": "One of today's commits"
    },
    {
        "id": 11,
        "date": "Sat Mar 20, 2021",
        "progress": "",
        "success": "",
        "challenge": "",
        "thoughts": "",
        "link": "",
        "linkTitle": ""
    }
]